#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
module.kv.data.azurerm_client_config.current: Reading...
module.resource_group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae]
module.kv.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03ZWM4YjkyZi02NzEyLTRkZDUtOTBiYy1iNmY2NGNjY2ZjMGU7b2JqZWN0SWQ9ZDA1ODQyNGEtYjdjOC00Y2JmLTljYzktNmUwODkxNzAzNTdjO3N1YnNjcmlwdGlvbklkPTc3MzQ4ZTZjLTAyODYtNDk2Zi04MzM2LTI4ZTk2NmIxMzY0ODt0ZW5hbnRJZD1lNjBiYjc2Yy04ZmRhLTRlZDQtYTM1NC00ODM2ZTNiZmNiYzM=]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03ZWM4YjkyZi02NzEyLTRkZDUtOTBiYy1iNmY2NGNjY2ZjMGU7b2JqZWN0SWQ9ZDA1ODQyNGEtYjdjOC00Y2JmLTljYzktNmUwODkxNzAzNTdjO3N1YnNjcmlwdGlvbklkPTc3MzQ4ZTZjLTAyODYtNDk2Zi04MzM2LTI4ZTk2NmIxMzY0ODt0ZW5hbnRJZD1lNjBiYjc2Yy04ZmRhLTRlZDQtYTM1NC00ODM2ZTNiZmNiYzM=]
module.usi.azurerm_user_assigned_identity.msi: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae]
module.kv.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.KeyVault/vaults/kv-biotrackr-prod-ae]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Network/virtualNetworks/vnet-biotrackr-prod-ae]
module.mag.azurerm_monitor_action_group.amg: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Insights/actionGroups/Biotrackr-Action-Group]
module.law.azurerm_log_analytics_workspace.law: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.OperationalInsights/workspaces/law-biotrackr-prod-ae]
module.aca_subnet.azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Network/virtualNetworks/vnet-biotrackr-prod-ae/subnets/infrastructure-subnet]
module.budget.azurerm_consumption_budget_resource_group.budget: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Consumption/budgets/Biotrackr-Budget]
module.sb.azurerm_servicebus_namespace.sb: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ServiceBus/namespaces/sb-biotrackr-prod-ae]
module.acr.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ContainerRegistry/registries/acrbiotrackrprodae]
module.appconfig.azurerm_app_configuration.appconfig: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.AppConfiguration/configurationStores/appconfig-biotrackr-prod-ae]
module.ai.azurerm_application_insights.ai: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Insights/components/ai-biotrackr-prod-ae]
module.aca_env.azurerm_container_app_environment.env: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae]
module.appconfig_data_reader_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.AppConfiguration/configurationStores/appconfig-biotrackr-prod-ae/providers/Microsoft.Authorization/roleAssignments/707c5afd-62cc-3eb1-9ba1-7cb9a746b2ac]
module.acr_pull_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ContainerRegistry/registries/acrbiotrackrprodae/providers/Microsoft.Authorization/roleAssignments/77495baf-63e2-0545-7992-61421922196c]
azurerm_container_app_environment_dapr_component.pubsub: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae/daprComponents/sb-pubsub]
module.sb_receiver_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ServiceBus/namespaces/sb-biotrackr-prod-ae/providers/Microsoft.Authorization/roleAssignments/aa1b903d-a2db-c941-f269-3599cc278674]
module.activity_queue.azurerm_servicebus_queue.queue: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ServiceBus/namespaces/sb-biotrackr-prod-ae/queues/activity-queue]
module.sb_sender_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ServiceBus/namespaces/sb-biotrackr-prod-ae/providers/Microsoft.Authorization/roleAssignments/dfe07edc-f8f7-6c73-11c7-fd293e4a5358]
azurerm_app_configuration_key.activity_queue_key: Refreshing state... [id=https://appconfig-biotrackr-prod-ae.azconfig.io/kv/biotrackr:activity-queue?label=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_container_app_environment_dapr_component.pubsub will be updated in-place
  ~ resource "azurerm_container_app_environment_dapr_component" "pubsub" {
        id                           = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae/daprComponents/sb-pubsub"
        name                         = "sb-pubsub"
        # (6 unchanged attributes hidden)

      + metadata {
          + name  = "namespaceName"
          + value = "https://sb-biotrackr-prod-ae.servicebus.windows.net:443/"
        }

        # (1 unchanged block hidden)
    }

  # module.cosmosdb.azurerm_cosmosdb_account.acc will be created
  + resource "azurerm_cosmosdb_account" "acc" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + automatic_failover_enabled                   = false
      + burst_capacity_enabled                       = false
      + connection_strings                           = (sensitive value)
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + enable_automatic_failover                    = (known after apply)
      + enable_free_tier                             = (known after apply)
      + enable_multiple_write_locations              = (known after apply)
      + endpoint                                     = (known after apply)
      + free_tier_enabled                            = true
      + id                                           = (known after apply)
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "GlobalDocumentDB"
      + local_authentication_disabled                = false
      + location                                     = "australiaeast"
      + minimal_tls_version                          = (known after apply)
      + mongo_server_version                         = (known after apply)
      + multiple_write_locations_enabled             = (known after apply)
      + name                                         = "cosmos-biotrackr-prod-ae"
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = true
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "rg-biotrackr-prod-ae"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + tags                                         = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
      + write_endpoints                              = (known after apply)

      + analytical_storage (known after apply)

      + backup (known after apply)

      + capabilities (known after apply)

      + capacity (known after apply)

      + consistency_policy {
          + consistency_level = "Session"
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "australiaeast"
          + zone_redundant    = false
        }
    }

  # module.cosmosdb.azurerm_cosmosdb_sql_container.container will be created
  + resource "azurerm_cosmosdb_sql_container" "container" {
      + account_name          = "cosmos-biotrackr-prod-ae"
      + database_name         = "biotrackr"
      + id                    = (known after apply)
      + name                  = "fitbitrecords"
      + partition_key_kind    = "Hash"
      + partition_key_path    = (known after apply)
      + partition_key_paths   = [
          + "/documentType",
        ]
      + partition_key_version = 1
      + resource_group_name   = "rg-biotrackr-prod-ae"
      + throughput            = 1000

      + conflict_resolution_policy (known after apply)

      + indexing_policy {
          + indexing_mode = "consistent"

          + included_path {
              + path = "/*"
            }
        }
    }

  # module.cosmosdb.azurerm_cosmosdb_sql_database.db will be created
  + resource "azurerm_cosmosdb_sql_database" "db" {
      + account_name        = "cosmos-biotrackr-prod-ae"
      + id                  = (known after apply)
      + name                = "biotrackr"
      + resource_group_name = "rg-biotrackr-prod-ae"
      + throughput          = 1000
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @willvelida, Action: `pull_request`*